[
  {
    "id": "1",
    "failureMode": "Exposed Wire",
    "process": "AL-Pet Laser Marking and Manual AL-Pet removal",
    "criteriaAcceptanceLimit": "AL-PH061",
    "dri": "Yhel",
    "category": "MACHINE",
    "failureAnalysisRootCause": "AL-Pet laser marking penetrate the insulation causing for initial damage and resulted to expose wire at soldering process. If encountered frequent exposed conductor with consistent location or area, too much laser power is the problem. If not so frequent occurrence or just isolated cases only, the caused shall be the damaged AL-Pet before AL-Pet laser marking.",
    "correctiveAction": "If encountered exposed conductor near the braided wire or on AL-Pet laser portion, immediately check if AL-Pet laser marking is deep. Once confirmed deep laser marking, call technician or engineer immediately and request adjustment on laser power. Immediately feedback to Berico cut process to avoid damaging the AL-Pet.",
    "images": [],
    "createdAt": "2026-01-14",
    "updatedAt": "2026-01-14",
    "createdBy": "Quality Engineer",
    "isActive": true
  },
  {
    "id": "2",
    "failureMode": "Exposed Wire",
    "process": "AL-Pet Laser Marking and Manual AL-Pet removal",
    "criteriaAcceptanceLimit": "AL-PH061",
    "dri": "Yhel",
    "category": "MAN",
    "failureAnalysisRootCause": "If the appearance of exposed conductor is like wounded or scratched, it is caused by metal pincette during manual AL-Pet Removal.",
    "correctiveAction": "Immediately feedback to AL-removal process and orient them with proper procedure. Use pincette to hold the AL-Pet and twist it until it was removed. Call technician or engineer in-charge to check AL-Pet Laser marking equipment to adjust the machine and avoid manual removal using pincette.",
    "images": [],
    "createdAt": "2026-01-14",
    "updatedAt": "2026-01-14",
    "createdBy": "Quality Engineer",
    "isActive": true
  },
  {
    "id": "3",
    "failureMode": "Exposed Wire",
    "process": "Lowside Endstrip Process",
    "criteriaAcceptanceLimit": "AL-PH061",
    "dri": "Yhel",
    "category": "MACHINE",
    "failureAnalysisRootCause": "If exposed conductor was located on upside signal wires and on the inner portion, the caused is lowside endstrip palette cover attachment. Since the upside signal wires were bended upward during lowside endstrip, the sharp edge of cover attachment damaged the insulation and resulted to exposed conductor.",
    "correctiveAction": "Modified the cover attachment of endstrip palette to avoid hitting the signal wire. Always check the palette cover attachment of lowside endstrip process if have slotted portion or not.",
    "images": [],
    "createdAt": "2026-01-14",
    "updatedAt": "2026-01-14",
    "createdBy": "Quality Engineer",
    "isActive": true
  },
  {
    "id": "4",
    "failureMode": "Exposed Wire",
    "process": "Ground Shell Assembly",
    "criteriaAcceptanceLimit": "AL-PH061",
    "dri": "Yhel",
    "category": "MACHINE",
    "failureAnalysisRootCause": "Too much heat on tinning machine can caused expansion of insulation. Due to expansion, holder became tight or stacked on its initial position and forcedly moved at ground shell assembly, resulting in an exposed conductor.",
    "correctiveAction": "Strictly follow the tinning bath temperature specification which is 260 ± 15 °C",
    "images": [],
    "createdAt": "2026-01-14",
    "updatedAt": "2026-01-14",
    "createdBy": "Quality Engineer",
    "isActive": true
  },
  {
    "id": "5",
    "failureMode": "Exposed Wire",
    "process": "Soldering Process",
    "criteriaAcceptanceLimit": "AL-PH061",
    "dri": "Yhel",
    "category": "MAN",
    "failureAnalysisRootCause": "If the exposed conductor located at the mid-portion of insulation and have large damaged on insulation, it is caused by mold tool or pincette during soldering. Unstable condition of insulation or conductor length was the reason of pulling or pushing of cable using mold tool or pincette.",
    "correctiveAction": "Modify the endstrip palette attachment to have stable dimension of insulation and conductor and prevent pulling or pushing of cable during soldering.",
    "images": [],
    "createdAt": "2026-01-14",
    "updatedAt": "2026-01-14",
    "createdBy": "Quality Engineer",
    "isActive": true
  },
  {
    "id": "6",
    "failureMode": "Exposed Wire",
    "process": "Soldering Process",
    "criteriaAcceptanceLimit": "AL-PH061",
    "dri": "Yhel",
    "category": "MACHINE",
    "failureAnalysisRootCause": "Due to too much heat during soldering, insulation melts and combined with other signal wire and if separated, it caused exposed conductor.",
    "correctiveAction": "Reduced the heating time as below table. LOW SIDE: 1st heating timer - Range: 0.5 to 2s, Current: 1s, Plan: 0.8s; 2nd heating timer - Range: 0 to 2s, Current: 1s, Plan: 0.5s. UP SIDE: 1st heating timer - Range: 0.5 to 2s, Current: 1s, Plan: 0.8s; 2nd heating timer - Range: 0 to 2s, Current: 1s, Plan: 0.5s. We will also strictly implement the 260 ± 15 °C tinning bath temperature.",
    "images": [],
    "createdAt": "2026-01-14",
    "updatedAt": "2026-01-14",
    "createdBy": "Quality Engineer",
    "isActive": true
  }
]
